{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>brand</th>\n",
       "      <th>categories</th>\n",
       "      <th>manufacturer</th>\n",
       "      <th>rating</th>\n",
       "      <th>text</th>\n",
       "      <th>username</th>\n",
       "      <th>age</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>Electronics,iPad &amp; Tablets,All Tablets,Fire Ta...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>5.0</td>\n",
       "      <td>This product so far has not disappointed. My c...</td>\n",
       "      <td>Adapter</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>Electronics,iPad &amp; Tablets,All Tablets,Fire Ta...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>5.0</td>\n",
       "      <td>great for beginner or experienced person. Boug...</td>\n",
       "      <td>truman</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>Electronics,iPad &amp; Tablets,All Tablets,Fire Ta...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>5.0</td>\n",
       "      <td>Inexpensive tablet for him to use and learn on...</td>\n",
       "      <td>DaveZ</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>Electronics,iPad &amp; Tablets,All Tablets,Fire Ta...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>4.0</td>\n",
       "      <td>I've had my Fire HD 8 two weeks now and I love...</td>\n",
       "      <td>Shacks</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>Electronics,iPad &amp; Tablets,All Tablets,Fire Ta...</td>\n",
       "      <td>Amazon</td>\n",
       "      <td>5.0</td>\n",
       "      <td>I bought this for my grand daughter when she c...</td>\n",
       "      <td>explore42</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index  id                                               name   brand  \\\n",
       "0      0   1  All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...  Amazon   \n",
       "1      1   1  All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...  Amazon   \n",
       "2      2   1  All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...  Amazon   \n",
       "3      3   1  All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...  Amazon   \n",
       "4      4   1  All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi,...  Amazon   \n",
       "\n",
       "                                          categories manufacturer  rating  \\\n",
       "0  Electronics,iPad & Tablets,All Tablets,Fire Ta...       Amazon     5.0   \n",
       "1  Electronics,iPad & Tablets,All Tablets,Fire Ta...       Amazon     5.0   \n",
       "2  Electronics,iPad & Tablets,All Tablets,Fire Ta...       Amazon     5.0   \n",
       "3  Electronics,iPad & Tablets,All Tablets,Fire Ta...       Amazon     4.0   \n",
       "4  Electronics,iPad & Tablets,All Tablets,Fire Ta...       Amazon     5.0   \n",
       "\n",
       "                                                text   username  age  \n",
       "0  This product so far has not disappointed. My c...    Adapter   60  \n",
       "1  great for beginner or experienced person. Boug...     truman   48  \n",
       "2  Inexpensive tablet for him to use and learn on...      DaveZ   28  \n",
       "3  I've had my Fire HD 8 two weeks now and I love...     Shacks   48  \n",
       "4  I bought this for my grand daughter when she c...  explore42   31  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = pd.read_csv(\"cleaned_result.csv\")\n",
    "result.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# make connection to the database\n",
    "conn = Neo4jConnection(uri = \"neo4j://localhost:7687\",\n",
    "                       user = \"neo4j\",              \n",
    "                       #pwd = \"Hjm123456\"\n",
    "                      pwd = 'Anni,0710')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "#clear database\n",
    "def clear(conn):\n",
    "    conn.query('match(n) detach delete n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Adds user nodes\n",
    "def add_users():\n",
    "    user_df = pd.read_csv(\"user.csv\")\n",
    "    \n",
    "    query = '''\n",
    "    UNWIND $rows AS row\n",
    "    MERGE (u:User {username: row.username, age: row.age})\n",
    "    '''\n",
    "    return conn.query(query, parameters = {'rows': user_df.to_dict('records')})    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Adds product nodes and the relation: user reviews product to the Neo4j graph.\n",
    "def add_products():\n",
    "    product_df = pd.read_csv(\"product.csv\")\n",
    "    \n",
    "    query = '''\n",
    "    UNWIND $rows AS row\n",
    "    MERGE (p:Product {id: row.id, name: row.name, brand:row.brand, manufacturer:row.manufacturer})\n",
    "    '''\n",
    "    return conn.query(query, parameters = {'rows': product_df.to_dict('records')})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add relation between user and product: user reviews product.\n",
    "def add_user_product_relation(dataframe):\n",
    "    \n",
    "    query = '''\n",
    "    UNWIND $rows as row\n",
    "    MATCH (u: User {username: row.username})\n",
    "    MATCH (p:Product {id: row.id})\n",
    "    MERGE (u)-[:Reviews {id:row.index, rating:row.rating, text:row.text}]->(p)\n",
    "    '''\n",
    "    return conn.query(query, parameters = {'rows': dataframe.to_dict('records')})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Adds category nodes to the Neo4j graph.\n",
    "def add_categories():\n",
    "    \n",
    "    buffer_category_lists = []\n",
    "    unique_category = []\n",
    "    \n",
    "    category_lists = list(result[\"categories\"])\n",
    "        \n",
    "    buffer_category_lists = [string.split(\",\") for string in category_lists]\n",
    "    for i in buffer_category_lists:\n",
    "        for j in i:\n",
    "            unique_category.append(j)\n",
    "    \n",
    "    # get unique category list\n",
    "    unique_category = list(set(unique_category))\n",
    "    \n",
    "    for category in unique_category:\n",
    "        c = '\"' + category +'\"'\n",
    "        query = ''' \n",
    "        create(c:Category {category: \n",
    "        ''' + c + '''})'''\n",
    "        conn.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_product_categories_relation(dataframe):\n",
    "    query = '''\n",
    "    UNWIND $rows as row\n",
    "    UNWIND row.categories AS category_name\n",
    "    MATCH (p:Product {id: row.id})\n",
    "    MATCH (c:Category {category: category_name})\n",
    "    MERGE (p)-[:IN_CATEGORY]->(c)\n",
    "   '''\n",
    "    return conn.query(query, parameters = {'rows':dataframe.to_dict('records')})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "product finished\n",
      "category finished\n",
      "Query failed: {code: Neo.ClientError.Schema.ConstraintValidationFailed} {message: Node(135809) already exists with label `User` and property `username` = 'johnbgood'}\n",
      "user finished\n",
      "review finished\n"
     ]
    }
   ],
   "source": [
    "#construct graph\n",
    "clear(conn)\n",
    "# set constrain to nodes so that they won't repeatly added \n",
    "# conn.query('CREATE CONSTRAINT User IF NOT EXISTS ON (u:User) ASSERT u.username IS UNIQUE')\n",
    "# conn.query('CREATE CONSTRAINT Product IF NOT EXISTS ON (p:Product) ASSERT p.id IS UNIQUE')\n",
    "# conn.query('CREATE CONSTRAINT Category IF NOT EXISTS ON (c:Category) ASSERT c.category IS UNIQUE')\n",
    "\n",
    "add_products()\n",
    "print('product finished')\n",
    "add_categories()\n",
    "print('category finished')\n",
    "add_users()\n",
    "print('user finished')\n",
    "add_user_product_relation(result)\n",
    "print('review finished')\n",
    "add_product_categories_relation(result)\n",
    "print('in_category relation finished')\n",
    "# add_products(result.head(300))\n",
    "# add_users(result.head(300))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_product_categories_relation2(dataframe):\n",
    "    for index,row in dataframe.iterrows():\n",
    "        categories = list(row[4].split(\",\"))\n",
    "        product_id = \"% s\" % row[1]\n",
    "        for c in categories:\n",
    "            query = '''\n",
    "            MATCH (p:Product {id: '''+ product_id+'''})\n",
    "            MATCH (c:Category {category: \"''' + c + '''\"})\n",
    "            MERGE (p)-[:IN]->(c)\n",
    "           '''\n",
    "            conn.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "in_category relation finished\n"
     ]
    }
   ],
   "source": [
    "add_product_categories_relation2(result.head())\n",
    "print('in_category relation finished')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query('''MATCH(u:User)\n",
    "return u.username''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query('''MATCH(u:User)-[r:Reviews]->(p:Product)\n",
    "with u,count(p) as cou\n",
    "where cou>1\n",
    "return u.username, cou''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record p=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}> c=<Node id=134268 labels=frozenset({'Category'}) properties={'category': 'Computers & Tablets'}>>,\n",
       " <Record p=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}> c=<Node id=134447 labels=frozenset({'Category'}) properties={'category': 'Tablets'}>>,\n",
       " <Record p=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}> c=<Node id=134443 labels=frozenset({'Category'}) properties={'category': 'Fire Tablets'}>>,\n",
       " <Record p=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}> c=<Node id=134249 labels=frozenset({'Category'}) properties={'category': 'All Tablets'}>>,\n",
       " <Record p=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}> c=<Node id=134253 labels=frozenset({'Category'}) properties={'category': 'iPad & Tablets'}>>,\n",
       " <Record p=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}> c=<Node id=134505 labels=frozenset({'Category'}) properties={'category': 'Electronics'}>>]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query('match (p:Product) -[:IN]->(c:Category) return p,c')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "#build content-based filtering query\n",
    "def cbf_query(username):\n",
    "    username = '\"' + username+ '\"'\n",
    "    query = '''MATCH(u:User{username:'''+ username +'''})-[:Reviews]->(p:Product)-[:IN]->(c:Category)<-[:IN]-(p2:Product)\n",
    "WHERE NOT EXISTS ((u)-[:Reviews]->(p2))\n",
    "WITH p, p2, COUNT(c) AS intersection\n",
    "MATCH (p)-[:IN]->(pc:Category)\n",
    "WITH p, p2, intersection, COLLECT(pc.category) AS s1\n",
    "MATCH (p2)-[:IN]->(p2c:Category)\n",
    "WITH p, p2, s1, intersection, COLLECT(p2c.category) AS s2\n",
    "WITH p, p2, intersection, s1+[x IN s2 WHERE NOT x IN s1] AS union, s1, s2\n",
    "RETURN p.name as Userproduct, p2.name as Recommendate, s1 as UserProductCategory, s2 as RecommendateProductCategory, ((1.0*intersection)/SIZE(union)) AS jaccard ORDER BY jaccard DESC'''\n",
    "    return query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH(u:User{username:\"Adapter\"})-[:Reviews]->(p:Product)-[:IN]->(c:Category)<-[:IN]-(p2:Product)\n",
      "WHERE NOT EXISTS ((u)-[:Reviews]->(p2))\n",
      "WITH p, p2, COUNT(c) AS intersection\n",
      "MATCH (p)-[:IN]->(pc:Category)\n",
      "WITH p, p2, intersection, COLLECT(pc.category) AS s1\n",
      "MATCH (p2)-[:IN]->(p2c:Category)\n",
      "WITH p, p2, s1, intersection, COLLECT(p2c.category) AS s2\n",
      "WITH p, p2, intersection, s1+[x IN s2 WHERE NOT x IN s1] AS union, s1, s2\n",
      "RETURN p.name as Userproduct, p2.name as Recommendate, s1 as UserProductCategory, s2 as RecommendateProductCategory, ((1.0*intersection)/SIZE(union)) AS jaccard ORDER BY jaccard DESC\n"
     ]
    }
   ],
   "source": [
    "print(cbf_query('Adapter'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record n=<Node id=134149 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Magenta', 'id': 1, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134150 labels=frozenset({'Product'}) properties={'name': 'Kindle Oasis E-reader with Leather Charging Cover - Merlot, 6 High-Resolution Display (300 ppi), Wi-Fi - Includes Special Offers,,', 'id': 2, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134151 labels=frozenset({'Product'}) properties={'name': 'Amazon Kindle Lighted Leather Cover,,,\\r\\nAmazon Kindle Lighted Leather Cover,,,', 'id': 3, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134152 labels=frozenset({'Product'}) properties={'name': 'Kindle Keyboard,,,\\r\\nKindle Keyboard,,,', 'id': 4, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134153 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 32 GB - Includes Special Offers, Magenta', 'id': 5, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134154 labels=frozenset({'Product'}) properties={'name': 'Fire HD 8 Tablet with Alexa, 8 HD Display, 32 GB, Tangerine - with Special Offers,', 'id': 6, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134155 labels=frozenset({'Product'}) properties={'name': 'Amazon 5W USB Official OEM Charger and Power Adapter for Fire Tablets and Kindle eReaders,,,\\r\\nAmazon 5W USB Official OEM Charger and Power Adapter for Fire Tablets and Kindle eReaders,,,', 'id': 7, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134156 labels=frozenset({'Product'}) properties={'name': 'Amazon Kindle Fire Hd (3rd Generation) 8gb,,,\\r\\nAmazon Kindle Fire Hd (3rd Generation) 8gb,,,', 'id': 8, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134157 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Magenta', 'id': 9, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134158 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Magenta', 'id': 10, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134159 labels=frozenset({'Product'}) properties={'name': 'Brand New Amazon Kindle Fire 16gb 7 Ips Display Tablet Wifi 16 Gb Blue,,,', 'id': 11, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134160 labels=frozenset({'Product'}) properties={'name': 'Brand New Amazon Kindle Fire 16gb 7 Ips Display Tablet Wifi 16 Gb Blue,,,', 'id': 12, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134161 labels=frozenset({'Product'}) properties={'name': 'Brand New Amazon Kindle Fire 16gb 7 Ips Display Tablet Wifi 16 Gb Blue,,,', 'id': 13, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134162 labels=frozenset({'Product'}) properties={'name': 'Brand New Amazon Kindle Fire 16gb 7 Ips Display Tablet Wifi 16 Gb Blue,,,', 'id': 14, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134163 labels=frozenset({'Product'}) properties={'name': 'Brand New Amazon Kindle Fire 16gb 7 Ips Display Tablet Wifi 16 Gb Blue,,,', 'id': 15, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134164 labels=frozenset({'Product'}) properties={'name': 'Brand New Amazon Kindle Fire 16gb 7 Ips Display Tablet Wifi 16 Gb Blue,,,', 'id': 16, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134165 labels=frozenset({'Product'}) properties={'name': 'Fire Kids Edition Tablet, 7 Display, Wi-Fi, 16 GB, Green Kid-Proof Case', 'id': 17, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134166 labels=frozenset({'Product'}) properties={'name': 'Fire Kids Edition Tablet, 7 Display, Wi-Fi, 16 GB, Green Kid-Proof Case', 'id': 18, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134167 labels=frozenset({'Product'}) properties={'name': 'Amazon Kindle Paperwhite - eBook reader - 4 GB - 6 monochrome Paperwhite - touchscreen - Wi-Fi - black,,,', 'id': 19, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134168 labels=frozenset({'Product'}) properties={'name': 'Kindle Voyage E-reader, 6 High-Resolution Display (300 ppi) with Adaptive Built-in Light, PagePress Sensors, Wi-Fi - Includes Special Offers,', 'id': 20, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134169 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Black', 'id': 21, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134170 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Black', 'id': 22, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134171 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Black', 'id': 23, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134172 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Black', 'id': 24, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134173 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Black', 'id': 25, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134174 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet, 7 Display, Wi-Fi, 8 GB - Includes Special Offers, Black', 'id': 26, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134175 labels=frozenset({'Product'}) properties={'name': 'Echo (White),,,\\r\\nEcho (White),,,', 'id': 27, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134176 labels=frozenset({'Product'}) properties={'name': 'Echo (White),,,\\r\\nEcho (White),,,', 'id': 28, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134177 labels=frozenset({'Product'}) properties={'name': 'Echo (White),,,\\r\\nEcho (White),,,', 'id': 29, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134178 labels=frozenset({'Product'}) properties={'name': 'Echo (White),,,\\r\\nEcho (White),,,', 'id': 30, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134179 labels=frozenset({'Product'}) properties={'name': nan, 'id': 31, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134180 labels=frozenset({'Product'}) properties={'name': nan, 'id': 32, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134181 labels=frozenset({'Product'}) properties={'name': nan, 'id': 33, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134182 labels=frozenset({'Product'}) properties={'name': nan, 'id': 34, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134183 labels=frozenset({'Product'}) properties={'name': nan, 'id': 35, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134184 labels=frozenset({'Product'}) properties={'name': nan, 'id': 36, 'brand': 'Amazon Fire', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134185 labels=frozenset({'Product'}) properties={'name': nan, 'id': 37, 'brand': 'Amazon Echo', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134186 labels=frozenset({'Product'}) properties={'name': nan, 'id': 38, 'brand': 'Amazon Coco T', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134187 labels=frozenset({'Product'}) properties={'name': nan, 'id': 39, 'brand': 'Amazon Fire Tv', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134188 labels=frozenset({'Product'}) properties={'name': nan, 'id': 40, 'brand': 'Amazon Digital Services Inc.', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134189 labels=frozenset({'Product'}) properties={'name': nan, 'id': 41, 'brand': 'Amazon', 'manufacturer': 'Amazon Digital Services, Inc'}>>,\n",
       " <Record n=<Node id=134190 labels=frozenset({'Product'}) properties={'name': nan, 'id': 42, 'brand': 'Amazon', 'manufacturer': 'Amazon Digital Services, Inc'}>>,\n",
       " <Record n=<Node id=134191 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics AAA Performance Alkaline Batteries (36 Count)', 'id': 43, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134192 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Nylon CD/DVD Binder (400 Capacity)', 'id': 44, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134193 labels=frozenset({'Product'}) properties={'name': 'Amazon Echo Show - Black', 'id': 45, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134194 labels=frozenset({'Product'}) properties={'name': 'Echo Spot Pair Kit (Black)', 'id': 46, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134195 labels=frozenset({'Product'}) properties={'name': 'Fire TV Stick Streaming Media Player Pair Kit', 'id': 47, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134196 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics AA Performance Alkaline Batteries (48 Count) - Packaging May Vary', 'id': 48, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134197 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Ventilated Adjustable Laptop Stand', 'id': 49, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134198 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Backpack for Laptops up to 17-inches', 'id': 50, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134199 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics 11.6-Inch Laptop Sleeve', 'id': 51, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134200 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics 15.6-Inch Laptop and Tablet Bag', 'id': 52, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134201 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics External Hard Drive Case', 'id': 53, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134202 labels=frozenset({'Product'}) properties={'name': 'Expanding Accordion File Folder Plastic Portable Document Organizer Letter Size', 'id': 54, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134203 labels=frozenset({'Product'}) properties={'name': 'Cat Litter Box Covered Tray Kitten Extra Large Enclosed Hooded Hidden Toilet', 'id': 55, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134204 labels=frozenset({'Product'}) properties={'name': 'Kindle PowerFast International Charging Kit (for accelerated charging in over 200 countries)', 'id': 56, 'brand': 'Amazon', 'manufacturer': 'Amazon Digital Services'}>>,\n",
       " <Record n=<Node id=134205 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Silicone Hot Handle Cover/Holder - Red', 'id': 57, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134206 labels=frozenset({'Product'}) properties={'name': 'Amazon Kindle Charger Power Adapter Wall Charger And Usb Cable Micro Usb Cord', 'id': 58, 'brand': 'Amazon', 'manufacturer': 'Amazon Digital Services'}>>,\n",
       " <Record n=<Node id=134207 labels=frozenset({'Product'}) properties={'name': 'Amazon Echo (1st Generationcertified) Color:White Free Shipping', 'id': 59, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134208 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics USB 3.0 Cable - A-Male to B-Male - 6 Feet (1.8 Meters)', 'id': 60, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134209 labels=frozenset({'Product'}) properties={'name': 'Two Door Top Load Pet Kennel Travel Crate Dog Cat Pet Cage Carrier Box Tray 23\"', 'id': 61, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134210 labels=frozenset({'Product'}) properties={'name': 'Oem Amazon Kindle Power Usb Adapter Wall Travel Charger Fire/dx/+micro Usb Cable', 'id': 62, 'brand': 'Amazon', 'manufacturer': 'Amazon Digital Services'}>>,\n",
       " <Record n=<Node id=134211 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics 16-Gauge Speaker Wire - 100 Feet', 'id': 63, 'brand': 'Amazonbasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134212 labels=frozenset({'Product'}) properties={'name': 'Amazon Echo (2nd Generation) Smart Assistant Oak Finish Priority Shipping', 'id': 64, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134213 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Nespresso Pod Storage Drawer - 50 Capsule Capacity', 'id': 65, 'brand': 'AmazonBasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134214 labels=frozenset({'Product'}) properties={'name': 'Certified Refurbished Amazon Echo', 'id': 66, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134215 labels=frozenset({'Product'}) properties={'name': 'All-new Echo (2nd Generation) with improved sound, powered by Dolby, and a new design Walnut Finish', 'id': 67, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134216 labels=frozenset({'Product'}) properties={'name': 'Fire Kids Edition Tablet, 7 Display, Wi-Fi, 16 GB, Pink Kid-Proof Case', 'id': 68, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134217 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 32 GB - Includes Special Offers, Black', 'id': 69, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134218 labels=frozenset({'Product'}) properties={'name': 'All-New Fire 7 Tablet with Alexa, 7\" Display, 8 GB - Marine Blue', 'id': 70, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134219 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 16 GB - Includes Special Offers, Blue', 'id': 71, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134220 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet, 8 HD Display, Wi-Fi, 32 GB - Includes Special Offers, Blue', 'id': 72, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134221 labels=frozenset({'Product'}) properties={'name': 'Amazon Fire HD 8 with Alexa (8\" HD Display Tablet)', 'id': 73, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134222 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Single-Door Folding Metal Dog Crate - Large (42x28x30 Inches)', 'id': 74, 'brand': 'AmazonBasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134223 labels=frozenset({'Product'}) properties={'name': 'All-New Kindle Oasis E-reader - 7 High-Resolution Display (300 ppi), Waterproof, Built-In Audible, 32 GB, Wi-Fi + Free Cellular Connectivity', 'id': 75, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134224 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Double-Door Folding Metal Dog Crate - Medium (36x23x25 Inches)', 'id': 76, 'brand': 'AmazonBasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134225 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Kids Edition Tablet, 8 HD Display, 32 GB, Pink Kid-Proof Case', 'id': 77, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134226 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Kids Edition Tablet, 8 HD Display, 32 GB, Blue Kid-Proof Case', 'id': 78, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134227 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet with Alexa, 8 HD Display, 16 GB, Marine Blue - with Special Offers', 'id': 79, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134228 labels=frozenset({'Product'}) properties={'name': 'All-New Fire HD 8 Tablet with Alexa, 8 HD Display, 32 GB, Marine Blue - with Special Offers', 'id': 80, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134229 labels=frozenset({'Product'}) properties={'name': 'Fire Tablet with Alexa, 7 Display, 16 GB, Magenta - with Special Offers', 'id': 81, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134230 labels=frozenset({'Product'}) properties={'name': 'Echo Dot (Previous generation)', 'id': 82, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134231 labels=frozenset({'Product'}) properties={'name': 'Kindle Oasis E-reader with Leather Charging Cover - Walnut, 6 High-Resolution Display (300 ppi), Wi-Fi - Includes Special Offers', 'id': 83, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134232 labels=frozenset({'Product'}) properties={'name': 'All-New Kindle Oasis E-reader - 7 High-Resolution Display (300 ppi), Waterproof, Built-In Audible, 8 GB, Wi-Fi - Includes Special Offers', 'id': 84, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134233 labels=frozenset({'Product'}) properties={'name': 'Kindle E-reader - White, 6 Glare-Free Touchscreen Display, Wi-Fi - Includes Special Offers', 'id': 85, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134234 labels=frozenset({'Product'}) properties={'name': 'Amazon Fire TV Gaming Edition Streaming Media Player', 'id': 86, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134235 labels=frozenset({'Product'}) properties={'name': 'All-New Kindle Oasis E-reader - 7 High-Resolution Display (300 ppi), Waterproof, Built-In Audible, 32 GB, Wi-Fi - Includes Special Offers', 'id': 87, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134236 labels=frozenset({'Product'}) properties={'name': 'AmazonBasics Bluetooth Keyboard for Android Devices - Black', 'id': 88, 'brand': 'AmazonBasics', 'manufacturer': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134237 labels=frozenset({'Product'}) properties={'name': 'Amazon Kindle Replacement Power Adapter (Fits Latest Generation Kindle and Kindle DX) For shipment in the U.S only', 'id': 89, 'brand': 'Amazon', 'manufacturer': 'Amazon.com'}>>,\n",
       " <Record n=<Node id=134238 labels=frozenset({'Product'}) properties={'name': 'Amazon Echo Show Alexa-enabled Bluetooth Speaker with 7\" Screen', 'id': 90, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134239 labels=frozenset({'Product'}) properties={'name': 'Amazon Fire TV with 4K Ultra HD and Alexa Voice Remote (Pendant Design) | Streaming Media Player', 'id': 91, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134240 labels=frozenset({'Product'}) properties={'name': 'Amazon - Echo Plus w/ Built-In Hub - Silver', 'id': 92, 'brand': 'Amazon', 'manufacturer': 'Amazon'}>>,\n",
       " <Record n=<Node id=134241 labels=frozenset({'Category'}) properties={'category': 'File Folders & Accessories'}>>,\n",
       " <Record n=<Node id=134242 labels=frozenset({'Category'}) properties={'category': 'Streaming Devices'}>>,\n",
       " <Record n=<Node id=134243 labels=frozenset({'Category'}) properties={'category': 'Kitchen Dining Features'}>>,\n",
       " <Record n=<Node id=134244 labels=frozenset({'Category'}) properties={'category': 'Computer Accessories & Peripherals'}>>,\n",
       " <Record n=<Node id=134245 labels=frozenset({'Category'}) properties={'category': 'Cases & Covers'}>>,\n",
       " <Record n=<Node id=134246 labels=frozenset({'Category'}) properties={'category': 'Blank Audio/Video Media'}>>,\n",
       " <Record n=<Node id=134247 labels=frozenset({'Category'}) properties={'category': ' Video & Audio Accessories'}>>,\n",
       " <Record n=<Node id=134248 labels=frozenset({'Category'}) properties={'category': 'Expanding File Jackets Pockets'}>>,\n",
       " <Record n=<Node id=134249 labels=frozenset({'Category'}) properties={'category': 'All Tablets'}>>,\n",
       " <Record n=<Node id=134250 labels=frozenset({'Category'}) properties={'category': 'Android Tablets'}>>,\n",
       " <Record n=<Node id=134251 labels=frozenset({'Category'}) properties={'category': 'Camera Batteries'}>>,\n",
       " <Record n=<Node id=134252 labels=frozenset({'Category'}) properties={'category': 'Networking'}>>,\n",
       " <Record n=<Node id=134253 labels=frozenset({'Category'}) properties={'category': 'iPad & Tablets'}>>,\n",
       " <Record n=<Node id=134254 labels=frozenset({'Category'}) properties={'category': 'Filing Products'}>>,\n",
       " <Record n=<Node id=134255 labels=frozenset({'Category'}) properties={'category': 'MP3 Player Accessories'}>>,\n",
       " <Record n=<Node id=134256 labels=frozenset({'Category'}) properties={'category': 'Why Keep Them Waiting Prime Free Two-Day Shipping'}>>,\n",
       " <Record n=<Node id=134257 labels=frozenset({'Category'}) properties={'category': 'Tablets for Kids'}>>,\n",
       " <Record n=<Node id=134258 labels=frozenset({'Category'}) properties={'category': 'Remote Controls'}>>,\n",
       " <Record n=<Node id=134259 labels=frozenset({'Category'}) properties={'category': 'Expanding File Jackets & Pockets'}>>,\n",
       " <Record n=<Node id=134260 labels=frozenset({'Category'}) properties={'category': 'Portable Audio'}>>,\n",
       " <Record n=<Node id=134261 labels=frozenset({'Category'}) properties={'category': 'Amazon Devices & Accessories'}>>,\n",
       " <Record n=<Node id=134262 labels=frozenset({'Category'}) properties={'category': 'Home'}>>,\n",
       " <Record n=<Node id=134263 labels=frozenset({'Category'}) properties={'category': 'Amazon Echo'}>>,\n",
       " <Record n=<Node id=134264 labels=frozenset({'Category'}) properties={'category': 'Filing'}>>,\n",
       " <Record n=<Node id=134265 labels=frozenset({'Category'}) properties={'category': 'TVs Entertainment'}>>,\n",
       " <Record n=<Node id=134266 labels=frozenset({'Category'}) properties={'category': 'Home & Furniture Clearance'}>>,\n",
       " <Record n=<Node id=134267 labels=frozenset({'Category'}) properties={'category': 'Keyboards'}>>,\n",
       " <Record n=<Node id=134268 labels=frozenset({'Category'}) properties={'category': 'Computers & Tablets'}>>,\n",
       " <Record n=<Node id=134269 labels=frozenset({'Category'}) properties={'category': 'Cell Phone Batteries & Power'}>>,\n",
       " <Record n=<Node id=134270 labels=frozenset({'Category'}) properties={'category': ' Audio Player Accessories'}>>,\n",
       " <Record n=<Node id=134271 labels=frozenset({'Category'}) properties={'category': 'Computer Accessories'}>>,\n",
       " <Record n=<Node id=134272 labels=frozenset({'Category'}) properties={'category': 'Household Supplies'}>>,\n",
       " <Record n=<Node id=134273 labels=frozenset({'Category'}) properties={'category': 'Other Multipurpose Batteries'}>>,\n",
       " <Record n=<Node id=134274 labels=frozenset({'Category'}) properties={'category': 'Speaker Cables'}>>,\n",
       " <Record n=<Node id=134275 labels=frozenset({'Category'}) properties={'category': 'Amazon Echo Accessories'}>>,\n",
       " <Record n=<Node id=134276 labels=frozenset({'Category'}) properties={'category': 'Home & Garden'}>>,\n",
       " <Record n=<Node id=134277 labels=frozenset({'Category'}) properties={'category': 'Kindle Touch (4th Generation) Accessories'}>>,\n",
       " <Record n=<Node id=134278 labels=frozenset({'Category'}) properties={'category': 'Smart Speakers'}>>,\n",
       " <Record n=<Node id=134279 labels=frozenset({'Category'}) properties={'category': 'Expanding Files'}>>,\n",
       " <Record n=<Node id=134280 labels=frozenset({'Category'}) properties={'category': 'Robot Check'}>>,\n",
       " <Record n=<Node id=134281 labels=frozenset({'Category'}) properties={'category': 'iPod'}>>,\n",
       " <Record n=<Node id=134282 labels=frozenset({'Category'}) properties={'category': 'Smart Hub & Kits'}>>,\n",
       " <Record n=<Node id=134283 labels=frozenset({'Category'}) properties={'category': 'Featured Brands'}>>,\n",
       " <Record n=<Node id=134284 labels=frozenset({'Category'}) properties={'category': 'Bags'}>>,\n",
       " <Record n=<Node id=134285 labels=frozenset({'Category'}) properties={'category': 'Kitchen & Dining'}>>,\n",
       " <Record n=<Node id=134286 labels=frozenset({'Category'}) properties={'category': 'Laptop Cases & Bags'}>>,\n",
       " <Record n=<Node id=134287 labels=frozenset({'Category'}) properties={'category': 'See more File Pocket Expanding Folder Office Organizer ...'}>>,\n",
       " <Record n=<Node id=134288 labels=frozenset({'Category'}) properties={'category': 'Consumer Electronics'}>>,\n",
       " <Record n=<Node id=134289 labels=frozenset({'Category'}) properties={'category': 'Kitchen'}>>,\n",
       " <Record n=<Node id=134290 labels=frozenset({'Category'}) properties={'category': 'Used:Tablets'}>>,\n",
       " <Record n=<Node id=134291 labels=frozenset({'Category'}) properties={'category': 'All Streaming Media Players'}>>,\n",
       " <Record n=<Node id=134292 labels=frozenset({'Category'}) properties={'category': 'Home Kitchen Features'}>>,\n",
       " <Record n=<Node id=134293 labels=frozenset({'Category'}) properties={'category': 'Kindle Fire (2nd Generation) Accessories'}>>,\n",
       " <Record n=<Node id=134294 labels=frozenset({'Category'}) properties={'category': 'Home Automation'}>>,\n",
       " <Record n=<Node id=134295 labels=frozenset({'Category'}) properties={'category': 'Kindle Accessories'}>>,\n",
       " <Record n=<Node id=134296 labels=frozenset({'Category'}) properties={'category': 'Fire TV Accessories'}>>,\n",
       " <Record n=<Node id=134297 labels=frozenset({'Category'}) properties={'category': 'Office'}>>,\n",
       " <Record n=<Node id=134298 labels=frozenset({'Category'}) properties={'category': 'Amazon Book Reader Accessory'}>>,\n",
       " <Record n=<Node id=134299 labels=frozenset({'Category'}) properties={'category': 'Power & Speaker Wire'}>>,\n",
       " <Record n=<Node id=134300 labels=frozenset({'Category'}) properties={'category': 'Backpacks'}>>,\n",
       " <Record n=<Node id=134301 labels=frozenset({'Category'}) properties={'category': 'Vehicle Electronics & GPS'}>>,\n",
       " <Record n=<Node id=134302 labels=frozenset({'Category'}) properties={'category': 'All Bluetooth & Wireless Speakers'}>>,\n",
       " <Record n=<Node id=134303 labels=frozenset({'Category'}) properties={'category': 'Video Games'}>>,\n",
       " <Record n=<Node id=134304 labels=frozenset({'Category'}) properties={'category': 'Smart Home Automation'}>>,\n",
       " <Record n=<Node id=134305 labels=frozenset({'Category'}) properties={'category': 'Office & School Supplies'}>>,\n",
       " <Record n=<Node id=134306 labels=frozenset({'Category'}) properties={'category': \"Kids' Tablets\"}>>,\n",
       " <Record n=<Node id=134307 labels=frozenset({'Category'}) properties={'category': 'On To College'}>>,\n",
       " <Record n=<Node id=134308 labels=frozenset({'Category'}) properties={'category': 'Lotions'}>>,\n",
       " <Record n=<Node id=134309 labels=frozenset({'Category'}) properties={'category': 'Laptop & Desktop Accessories'}>>,\n",
       " <Record n=<Node id=134310 labels=frozenset({'Category'}) properties={'category': 'Carrying Case Or Bag'}>>,\n",
       " <Record n=<Node id=134311 labels=frozenset({'Category'}) properties={'category': 'Disc Storage Wallets'}>>,\n",
       " <Record n=<Node id=134312 labels=frozenset({'Category'}) properties={'category': ' Storage & Blank Media'}>>,\n",
       " <Record n=<Node id=134313 labels=frozenset({'Category'}) properties={'category': ' DVD & Blu-ray Discs'}>>,\n",
       " <Record n=<Node id=134314 labels=frozenset({'Category'}) properties={'category': 'Hard Drive Bags Cases'}>>,\n",
       " <Record n=<Node id=134315 labels=frozenset({'Category'}) properties={'category': 'computers'}>>,\n",
       " <Record n=<Node id=134316 labels=frozenset({'Category'}) properties={'category': 'Books & Magazines'}>>,\n",
       " <Record n=<Node id=134317 labels=frozenset({'Category'}) properties={'category': 'Holiday Shop'}>>,\n",
       " <Record n=<Node id=134318 labels=frozenset({'Category'}) properties={'category': 'Chargers & Sync Cables'}>>,\n",
       " <Record n=<Node id=134319 labels=frozenset({'Category'}) properties={'category': 'Book Accessories'}>>,\n",
       " <Record n=<Node id=134320 labels=frozenset({'Category'}) properties={'category': 'Wired Headsets & Speakers'}>>,\n",
       " <Record n=<Node id=134321 labels=frozenset({'Category'}) properties={'category': 'Cable Or Adapter'}>>,\n",
       " <Record n=<Node id=134322 labels=frozenset({'Category'}) properties={'category': 'Covers'}>>,\n",
       " <Record n=<Node id=134323 labels=frozenset({'Category'}) properties={'category': 'Consoles'}>>,\n",
       " <Record n=<Node id=134324 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Echo Show Smart Assistant - White'}>>,\n",
       " <Record n=<Node id=134325 labels=frozenset({'Category'}) properties={'category': 'College Tvs & Home Theater'}>>,\n",
       " <Record n=<Node id=134326 labels=frozenset({'Category'}) properties={'category': 'Dogs'}>>,\n",
       " <Record n=<Node id=134327 labels=frozenset({'Category'}) properties={'category': ' Tech Toys'}>>,\n",
       " <Record n=<Node id=134328 labels=frozenset({'Category'}) properties={'category': 'Home & Kitchen'}>>,\n",
       " <Record n=<Node id=134329 labels=frozenset({'Category'}) properties={'category': 'Health'}>>,\n",
       " <Record n=<Node id=134330 labels=frozenset({'Category'}) properties={'category': 'Top Rated'}>>,\n",
       " <Record n=<Node id=134331 labels=frozenset({'Category'}) properties={'category': 'Power Adapters Cables'}>>,\n",
       " <Record n=<Node id=134332 labels=frozenset({'Category'}) properties={'category': 'Tablet Accessories'}>>,\n",
       " <Record n=<Node id=134333 labels=frozenset({'Category'}) properties={'category': 'Amazon SMP'}>>,\n",
       " <Record n=<Node id=134334 labels=frozenset({'Category'}) properties={'category': 'Crates & Kennels'}>>,\n",
       " <Record n=<Node id=134335 labels=frozenset({'Category'}) properties={'category': ' Global Wireless) Accessories'}>>,\n",
       " <Record n=<Node id=134336 labels=frozenset({'Category'}) properties={'category': 'Health and Beauty'}>>,\n",
       " <Record n=<Node id=134337 labels=frozenset({'Category'}) properties={'category': 'Computers & Laptops'}>>,\n",
       " <Record n=<Node id=134338 labels=frozenset({'Category'}) properties={'category': 'Speakers'}>>,\n",
       " <Record n=<Node id=134339 labels=frozenset({'Category'}) properties={'category': 'Kids & Family'}>>,\n",
       " <Record n=<Node id=134340 labels=frozenset({'Category'}) properties={'category': 'Top Cat Supplies'}>>,\n",
       " <Record n=<Node id=134341 labels=frozenset({'Category'}) properties={'category': 'Computer Add On'}>>,\n",
       " <Record n=<Node id=134342 labels=frozenset({'Category'}) properties={'category': 'Pet Supplies'}>>,\n",
       " <Record n=<Node id=134343 labels=frozenset({'Category'}) properties={'category': 'College Ipads & Tablets'}>>,\n",
       " <Record n=<Node id=134344 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Fire TV with Alexa Voice Remote Digital...'}>>,\n",
       " <Record n=<Node id=134345 labels=frozenset({'Category'}) properties={'category': 'Kitchen Storage & Organization'}>>,\n",
       " <Record n=<Node id=134346 labels=frozenset({'Category'}) properties={'category': 'Expanding Wallets'}>>,\n",
       " <Record n=<Node id=134347 labels=frozenset({'Category'}) properties={'category': 'Smart Home & Home Automation Devices'}>>,\n",
       " <Record n=<Node id=134348 labels=frozenset({'Category'}) properties={'category': ' Cases & Sleeves'}>>,\n",
       " <Record n=<Node id=134349 labels=frozenset({'Category'}) properties={'category': 'Chargers & Adapters'}>>,\n",
       " <Record n=<Node id=134350 labels=frozenset({'Category'}) properties={'category': 'Speaker Systems'}>>,\n",
       " <Record n=<Node id=134351 labels=frozenset({'Category'}) properties={'category': 'Home & Outdoors'}>>,\n",
       " <Record n=<Node id=134352 labels=frozenset({'Category'}) properties={'category': 'Computers & Accessories'}>>,\n",
       " <Record n=<Node id=134353 labels=frozenset({'Category'}) properties={'category': 'Tablet Cases Covers'}>>,\n",
       " <Record n=<Node id=134354 labels=frozenset({'Category'}) properties={'category': 'Media Cases & Storage'}>>,\n",
       " <Record n=<Node id=134355 labels=frozenset({'Category'}) properties={'category': 'Smart Hubs & Wireless Routers'}>>,\n",
       " <Record n=<Node id=134356 labels=frozenset({'Category'}) properties={'category': ' Hubs & Accessories'}>>,\n",
       " <Record n=<Node id=134357 labels=frozenset({'Category'}) properties={'category': 'Home Audio'}>>,\n",
       " <Record n=<Node id=134358 labels=frozenset({'Category'}) properties={'category': 'Custom Stores'}>>,\n",
       " <Record n=<Node id=134359 labels=frozenset({'Category'}) properties={'category': 'Standard Litter Boxes'}>>,\n",
       " <Record n=<Node id=134360 labels=frozenset({'Category'}) properties={'category': 'Audio Cables'}>>,\n",
       " <Record n=<Node id=134361 labels=frozenset({'Category'}) properties={'category': 'Crates Kennels'}>>,\n",
       " <Record n=<Node id=134362 labels=frozenset({'Category'}) properties={'category': 'Wireless Speakers'}>>,\n",
       " <Record n=<Node id=134363 labels=frozenset({'Category'}) properties={'category': 'Office Furniture Lighting'}>>,\n",
       " <Record n=<Node id=134364 labels=frozenset({'Category'}) properties={'category': 'Car Audio & Video Installation'}>>,\n",
       " <Record n=<Node id=134365 labels=frozenset({'Category'}) properties={'category': 'Fire (5th Generation) Accessories'}>>,\n",
       " <Record n=<Node id=134366 labels=frozenset({'Category'}) properties={'category': 'iPads Tablets'}>>,\n",
       " <Record n=<Node id=134367 labels=frozenset({'Category'}) properties={'category': 'Laptop Computer Stands'}>>,\n",
       " <Record n=<Node id=134368 labels=frozenset({'Category'}) properties={'category': 'Personal Computer'}>>,\n",
       " <Record n=<Node id=134369 labels=frozenset({'Category'}) properties={'category': 'Moisturizers'}>>,\n",
       " <Record n=<Node id=134370 labels=frozenset({'Category'}) properties={'category': 'Hard Drive Pouches'}>>,\n",
       " <Record n=<Node id=134371 labels=frozenset({'Category'}) properties={'category': 'eReaders'}>>,\n",
       " <Record n=<Node id=134372 labels=frozenset({'Category'}) properties={'category': 'Audio'}>>,\n",
       " <Record n=<Node id=134373 labels=frozenset({'Category'}) properties={'category': 'Alarms & Sensors'}>>,\n",
       " <Record n=<Node id=134374 labels=frozenset({'Category'}) properties={'category': 'Audio & Video Components'}>>,\n",
       " <Record n=<Node id=134375 labels=frozenset({'Category'}) properties={'category': 'Amazon Home'}>>,\n",
       " <Record n=<Node id=134376 labels=frozenset({'Category'}) properties={'category': 'all electronics'}>>,\n",
       " <Record n=<Node id=134377 labels=frozenset({'Category'}) properties={'category': 'Accessories & Supplies'}>>,\n",
       " <Record n=<Node id=134378 labels=frozenset({'Category'}) properties={'category': 'Kindle DX (2nd Generation'}>>,\n",
       " <Record n=<Node id=134379 labels=frozenset({'Category'}) properties={'category': 'Speakers & Audio Systems'}>>,\n",
       " <Record n=<Node id=134380 labels=frozenset({'Category'}) properties={'category': 'Tablet & E-Reader Accessories'}>>,\n",
       " <Record n=<Node id=134381 labels=frozenset({'Category'}) properties={'category': 'Hubs & Controllers'}>>,\n",
       " <Record n=<Node id=134382 labels=frozenset({'Category'}) properties={'category': 'Crate Training'}>>,\n",
       " <Record n=<Node id=134383 labels=frozenset({'Category'}) properties={'category': 'Kitchen & Dining Features'}>>,\n",
       " <Record n=<Node id=134384 labels=frozenset({'Category'}) properties={'category': 'Cables'}>>,\n",
       " <Record n=<Node id=134385 labels=frozenset({'Category'}) properties={'category': 'Amazon Device Accessories'}>>,\n",
       " <Record n=<Node id=134386 labels=frozenset({'Category'}) properties={'category': 'Home Audio & Home Theater'}>>,\n",
       " <Record n=<Node id=134387 labels=frozenset({'Category'}) properties={'category': 'mazon.co.uk'}>>,\n",
       " <Record n=<Node id=134388 labels=frozenset({'Category'}) properties={'category': 'Stands'}>>,\n",
       " <Record n=<Node id=134389 labels=frozenset({'Category'}) properties={'category': 'Smead'}>>,\n",
       " <Record n=<Node id=134390 labels=frozenset({'Category'}) properties={'category': 'Business & Industrial'}>>,\n",
       " <Record n=<Node id=134391 labels=frozenset({'Category'}) properties={'category': 'Cases'}>>,\n",
       " <Record n=<Node id=134392 labels=frozenset({'Category'}) properties={'category': 'Office Products'}>>,\n",
       " <Record n=<Node id=134393 labels=frozenset({'Category'}) properties={'category': 'Computer Speakers'}>>,\n",
       " <Record n=<Node id=134394 labels=frozenset({'Category'}) properties={'category': 'See more AmazonBasics Double Door Folding Metal Dog Cra...'}>>,\n",
       " <Record n=<Node id=134395 labels=frozenset({'Category'}) properties={'category': 'Software & Books'}>>,\n",
       " <Record n=<Node id=134396 labels=frozenset({'Category'}) properties={'category': 'File & Folder Accessories'}>>,\n",
       " <Record n=<Node id=134397 labels=frozenset({'Category'}) properties={'category': 'Messenger Bags'}>>,\n",
       " <Record n=<Node id=134398 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Echo Spot Smart Assistant - Black'}>>,\n",
       " <Record n=<Node id=134399 labels=frozenset({'Category'}) properties={'category': 'Portable Audio & Electronics'}>>,\n",
       " <Record n=<Node id=134400 labels=frozenset({'Category'}) properties={'category': 'Kindle Store'}>>,\n",
       " <Record n=<Node id=134401 labels=frozenset({'Category'}) properties={'category': 'Bluetooth & Wireless Speakers'}>>,\n",
       " <Record n=<Node id=134402 labels=frozenset({'Category'}) properties={'category': 'Streaming Media Players'}>>,\n",
       " <Record n=<Node id=134403 labels=frozenset({'Category'}) properties={'category': 'Kindle Touch (4th Generation) Covers'}>>,\n",
       " <Record n=<Node id=134404 labels=frozenset({'Category'}) properties={'category': 'Electrical'}>>,\n",
       " <Record n=<Node id=134405 labels=frozenset({'Category'}) properties={'category': 'Drive Enclosures & Docks'}>>,\n",
       " <Record n=<Node id=134406 labels=frozenset({'Category'}) properties={'category': 'Other TV'}>>,\n",
       " <Record n=<Node id=134407 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Echo (1st Generation) Smart Assistant -...'}>>,\n",
       " <Record n=<Node id=134408 labels=frozenset({'Category'}) properties={'category': 'Mobile Bluetooth Speakers'}>>,\n",
       " <Record n=<Node id=134409 labels=frozenset({'Category'}) properties={'category': 'New Networking'}>>,\n",
       " <Record n=<Node id=134410 labels=frozenset({'Category'}) properties={'category': 'Surveillance & Smart Home Electronics'}>>,\n",
       " <Record n=<Node id=134411 labels=frozenset({'Category'}) properties={'category': 'Office Furniture & Lighting'}>>,\n",
       " <Record n=<Node id=134412 labels=frozenset({'Category'}) properties={'category': 'Notebook Computer Stands'}>>,\n",
       " <Record n=<Node id=134413 labels=frozenset({'Category'}) properties={'category': 'College Electronics'}>>,\n",
       " <Record n=<Node id=134414 labels=frozenset({'Category'}) properties={'category': 'Hard Drive Accessories'}>>,\n",
       " <Record n=<Node id=134415 labels=frozenset({'Category'}) properties={'category': 'Surveillance'}>>,\n",
       " <Record n=<Node id=134416 labels=frozenset({'Category'}) properties={'category': 'Office Electronics'}>>,\n",
       " <Record n=<Node id=134417 labels=frozenset({'Category'}) properties={'category': ' Stands & Shelves'}>>,\n",
       " <Record n=<Node id=134418 labels=frozenset({'Category'}) properties={'category': 'Dog Supplies'}>>,\n",
       " <Record n=<Node id=134419 labels=frozenset({'Category'}) properties={'category': 'TV'}>>,\n",
       " <Record n=<Node id=134420 labels=frozenset({'Category'}) properties={'category': 'iPad Accessories'}>>,\n",
       " <Record n=<Node id=134421 labels=frozenset({'Category'}) properties={'category': 'Computers/Tablets & Networking'}>>,\n",
       " <Record n=<Node id=134422 labels=frozenset({'Category'}) properties={'category': 'Internet & Media Streamers'}>>,\n",
       " <Record n=<Node id=134423 labels=frozenset({'Category'}) properties={'category': 'Batteries & Chargers'}>>,\n",
       " <Record n=<Node id=134424 labels=frozenset({'Category'}) properties={'category': ' Storage & Binding'}>>,\n",
       " <Record n=<Node id=134425 labels=frozenset({'Category'}) properties={'category': 'Pet Products'}>>,\n",
       " <Record n=<Node id=134426 labels=frozenset({'Category'}) properties={'category': 'Categories'}>>,\n",
       " <Record n=<Node id=134427 labels=frozenset({'Category'}) properties={'category': 'Home Audio & Video Accessories'}>>,\n",
       " <Record n=<Node id=134428 labels=frozenset({'Category'}) properties={'category': 'Digital Device Accessory'}>>,\n",
       " <Record n=<Node id=134429 labels=frozenset({'Category'}) properties={'category': 'Tablet & eBook Reader Accs'}>>,\n",
       " <Record n=<Node id=134430 labels=frozenset({'Category'}) properties={'category': 'Mobile Speakers'}>>,\n",
       " <Record n=<Node id=134431 labels=frozenset({'Category'}) properties={'category': 'eBook Readers & Accessories'}>>,\n",
       " <Record n=<Node id=134432 labels=frozenset({'Category'}) properties={'category': 'Batteries'}>>,\n",
       " <Record n=<Node id=134433 labels=frozenset({'Category'}) properties={'category': 'Amazon Tablet Accessory'}>>,\n",
       " <Record n=<Node id=134434 labels=frozenset({'Category'}) properties={'category': 'Video Devices & TV Tuners'}>>,\n",
       " <Record n=<Node id=134435 labels=frozenset({'Category'}) properties={'category': 'Filing & Organizers'}>>,\n",
       " <Record n=<Node id=134436 labels=frozenset({'Category'}) properties={'category': 'Tablets & E-Readers'}>>,\n",
       " <Record n=<Node id=134437 labels=frozenset({'Category'}) properties={'category': 'Kids Family'}>>,\n",
       " <Record n=<Node id=134438 labels=frozenset({'Category'}) properties={'category': 'Digital Device 4'}>>,\n",
       " <Record n=<Node id=134439 labels=frozenset({'Category'}) properties={'category': ' Video & Home Audio'}>>,\n",
       " <Record n=<Node id=134440 labels=frozenset({'Category'}) properties={'category': 'Portable Computer Accessories'}>>,\n",
       " <Record n=<Node id=134441 labels=frozenset({'Category'}) properties={'category': 'Home Audio Speakers'}>>,\n",
       " <Record n=<Node id=134442 labels=frozenset({'Category'}) properties={'category': 'Computers'}>>,\n",
       " <Record n=<Node id=134443 labels=frozenset({'Category'}) properties={'category': 'Fire Tablets'}>>,\n",
       " <Record n=<Node id=134444 labels=frozenset({'Category'}) properties={'category': 'Household Batteries'}>>,\n",
       " <Record n=<Node id=134445 labels=frozenset({'Category'}) properties={'category': 'Mobile'}>>,\n",
       " <Record n=<Node id=134446 labels=frozenset({'Category'}) properties={'category': 'Kindle (5th Generation) Covers'}>>,\n",
       " <Record n=<Node id=134447 labels=frozenset({'Category'}) properties={'category': 'Tablets'}>>,\n",
       " <Record n=<Node id=134448 labels=frozenset({'Category'}) properties={'category': 'Drives'}>>,\n",
       " <Record n=<Node id=134449 labels=frozenset({'Category'}) properties={'category': 'EBook Readers'}>>,\n",
       " <Record n=<Node id=134450 labels=frozenset({'Category'}) properties={'category': 'Portable Speakers'}>>,\n",
       " <Record n=<Node id=134451 labels=frozenset({'Category'}) properties={'category': 'Amazon Tap'}>>,\n",
       " <Record n=<Node id=134452 labels=frozenset({'Category'}) properties={'category': 'Camera & Photo'}>>,\n",
       " <Record n=<Node id=134453 labels=frozenset({'Category'}) properties={'category': 'Carriers & Totes'}>>,\n",
       " <Record n=<Node id=134454 labels=frozenset({'Category'}) properties={'category': 'Used:Computers Accessories'}>>,\n",
       " <Record n=<Node id=134455 labels=frozenset({'Category'}) properties={'category': 'Virtual Assistant Speakers'}>>,\n",
       " <Record n=<Node id=134456 labels=frozenset({'Category'}) properties={'category': 'Smart Hubs'}>>,\n",
       " <Record n=<Node id=134457 labels=frozenset({'Category'}) properties={'category': 'Portable Bluetooth Speakers'}>>,\n",
       " <Record n=<Node id=134458 labels=frozenset({'Category'}) properties={'category': 'AA'}>>,\n",
       " <Record n=<Node id=134459 labels=frozenset({'Category'}) properties={'category': ' Holders & Car Mounts'}>>,\n",
       " <Record n=<Node id=134460 labels=frozenset({'Category'}) properties={'category': 'Litter Boxes'}>>,\n",
       " <Record n=<Node id=134461 labels=frozenset({'Category'}) properties={'category': 'Office Supplies'}>>,\n",
       " <Record n=<Node id=134462 labels=frozenset({'Category'}) properties={'category': 'Abis Electronics'}>>,\n",
       " <Record n=<Node id=134463 labels=frozenset({'Category'}) properties={'category': 'eBook Readers'}>>,\n",
       " <Record n=<Node id=134464 labels=frozenset({'Category'}) properties={'category': 'Cages & Crates'}>>,\n",
       " <Record n=<Node id=134465 labels=frozenset({'Category'}) properties={'category': 'Amazon Book Reader'}>>,\n",
       " <Record n=<Node id=134466 labels=frozenset({'Category'}) properties={'category': 'Fire TV'}>>,\n",
       " <Record n=<Node id=134467 labels=frozenset({'Category'}) properties={'category': 'Beauty'}>>,\n",
       " <Record n=<Node id=134468 labels=frozenset({'Category'}) properties={'category': 'USB Cables'}>>,\n",
       " <Record n=<Node id=134469 labels=frozenset({'Category'}) properties={'category': 'Amazon Tablets'}>>,\n",
       " <Record n=<Node id=134470 labels=frozenset({'Category'}) properties={'category': 'Home Safety & Security'}>>,\n",
       " <Record n=<Node id=134471 labels=frozenset({'Category'}) properties={'category': ' Wi-Fi  3G (Unlocked...'}>>,\n",
       " <Record n=<Node id=134472 labels=frozenset({'Category'}) properties={'category': 'AmazonBasics'}>>,\n",
       " <Record n=<Node id=134473 labels=frozenset({'Category'}) properties={'category': 'Camcorder Batteries'}>>,\n",
       " <Record n=<Node id=134474 labels=frozenset({'Category'}) properties={'category': 'Health & Household'}>>,\n",
       " <Record n=<Node id=134475 labels=frozenset({'Category'}) properties={'category': 'Accessories'}>>,\n",
       " <Record n=<Node id=134476 labels=frozenset({'Category'}) properties={'category': 'Ready Meals'}>>,\n",
       " <Record n=<Node id=134477 labels=frozenset({'Category'}) properties={'category': 'TV & Video'}>>,\n",
       " <Record n=<Node id=134478 labels=frozenset({'Category'}) properties={'category': 'Cell Phone Accessories'}>>,\n",
       " <Record n=<Node id=134479 labels=frozenset({'Category'}) properties={'category': 'Electronics Features'}>>,\n",
       " <Record n=<Node id=134480 labels=frozenset({'Category'}) properties={'category': 'Amazon Ereaders'}>>,\n",
       " <Record n=<Node id=134481 labels=frozenset({'Category'}) properties={'category': 'Office Product'}>>,\n",
       " <Record n=<Node id=134482 labels=frozenset({'Category'}) properties={'category': 'Linens & Textiles'}>>,\n",
       " <Record n=<Node id=134483 labels=frozenset({'Category'}) properties={'category': ' Household & Baby Care'}>>,\n",
       " <Record n=<Node id=134484 labels=frozenset({'Category'}) properties={'category': 'Fire Tablet Accessories'}>>,\n",
       " <Record n=<Node id=134485 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Kindle Fire 5-Feet Micro USB Cable - Wh...'}>>,\n",
       " <Record n=<Node id=134486 labels=frozenset({'Category'}) properties={'category': 'Food Storage'}>>,\n",
       " <Record n=<Node id=134487 labels=frozenset({'Category'}) properties={'category': 'See more AmazonBasics 15.6 Inch Laptop And Tablet Bag -...'}>>,\n",
       " <Record n=<Node id=134488 labels=frozenset({'Category'}) properties={'category': 'Tablets & eBook Readers'}>>,\n",
       " <Record n=<Node id=134489 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Kindle Voyage 4GB'}>>,\n",
       " <Record n=<Node id=134490 labels=frozenset({'Category'}) properties={'category': 'Home & Tools'}>>,\n",
       " <Record n=<Node id=134491 labels=frozenset({'Category'}) properties={'category': 'E-Readers'}>>,\n",
       " <Record n=<Node id=134492 labels=frozenset({'Category'}) properties={'category': 'Compact Radios Stereos'}>>,\n",
       " <Record n=<Node id=134493 labels=frozenset({'Category'}) properties={'category': ' Mice & Accessories'}>>,\n",
       " <Record n=<Node id=134494 labels=frozenset({'Category'}) properties={'category': 'Virtual Assistant Speakers Displays'}>>,\n",
       " <Record n=<Node id=134495 labels=frozenset({'Category'}) properties={'category': 'Electronic Components'}>>,\n",
       " <Record n=<Node id=134496 labels=frozenset({'Category'}) properties={'category': 'TV & Home Theater'}>>,\n",
       " <Record n=<Node id=134497 labels=frozenset({'Category'}) properties={'category': 'Walmart for Business'}>>,\n",
       " <Record n=<Node id=134498 labels=frozenset({'Category'}) properties={'category': 'See more Amazon Kindle Voyage (Wi-Fi)'}>>,\n",
       " <Record n=<Node id=134499 labels=frozenset({'Category'}) properties={'category': 'Storage & Organization'}>>,\n",
       " <Record n=<Node id=134500 labels=frozenset({'Category'}) properties={'category': 'Sleeves'}>>,\n",
       " <Record n=<Node id=134501 labels=frozenset({'Category'}) properties={'category': 'City Sniffers'}>>,\n",
       " <Record n=<Node id=134502 labels=frozenset({'Category'}) properties={'category': 'Home Improvement'}>>,\n",
       " <Record n=<Node id=134503 labels=frozenset({'Category'}) properties={'category': 'All Windows Tablets'}>>,\n",
       " <Record n=<Node id=134504 labels=frozenset({'Category'}) properties={'category': 'Learning Toys'}>>,\n",
       " <Record n=<Node id=134505 labels=frozenset({'Category'}) properties={'category': 'Electronics'}>>,\n",
       " <Record n=<Node id=134506 labels=frozenset({'Category'}) properties={'category': 'Cat Supplies'}>>,\n",
       " <Record n=<Node id=134507 labels=frozenset({'Category'}) properties={'category': 'Audio & Video Accessories'}>>,\n",
       " <Record n=<Node id=134508 labels=frozenset({'Category'}) properties={'category': 'Cases & Bags'}>>,\n",
       " <Record n=<Node id=134509 labels=frozenset({'Category'}) properties={'category': 'Tablets & E-readers'}>>,\n",
       " <Record n=<Node id=134510 labels=frozenset({'Category'}) properties={'category': 'Files & Supplies'}>>,\n",
       " <Record n=<Node id=134511 labels=frozenset({'Category'}) properties={'category': 'Ways To Shop'}>>,\n",
       " <Record n=<Node id=134512 labels=frozenset({'Category'}) properties={'category': 'Home Security'}>>,\n",
       " <Record n=<Node id=134513 labels=frozenset({'Category'}) properties={'category': 'Media Streamers'}>>,\n",
       " <Record n=<Node id=134514 labels=frozenset({'Category'}) properties={'category': 'eReaders & Accessories'}>>,\n",
       " <Record n=<Node id=134515 labels=frozenset({'Category'}) properties={'category': 'Home Theater & Audio'}>>,\n",
       " <Record n=<Node id=134516 labels=frozenset({'Category'}) properties={'category': 'CD'}>>,\n",
       " <Record n=<Node id=134517 labels=frozenset({'Category'}) properties={'category': 'Digital Device 3'}>>,\n",
       " <Record n=<Node id=134518 labels=frozenset({'Category'}) properties={'category': 'Desk Accessories & Workspace Organizers'}>>,\n",
       " <Record n=<Node id=134519 labels=frozenset({'Category'}) properties={'category': 'Home & Kitchen Features'}>>,\n",
       " <Record n=<Node id=134520 labels=frozenset({'Category'}) properties={'category': 'Amazon'}>>,\n",
       " <Record n=<Node id=134521 labels=frozenset({'Category'}) properties={'category': 'Hard-Sided Carriers'}>>,\n",
       " <Record n=<Node id=134522 labels=frozenset({'Category'}) properties={'category': 'MP3 MP4 Player Accessories'}>>,\n",
       " <Record n=<Node id=134523 labels=frozenset({'Category'}) properties={'category': 'Toys'}>>,\n",
       " <Record n=<Node id=134524 labels=frozenset({'Category'}) properties={'category': 'Tablets & eReaders'}>>,\n",
       " <Record n=<Node id=134525 labels=frozenset({'Category'}) properties={'category': 'Kindle (5th Generation) Accessories'}>>,\n",
       " <Record n=<Node id=134526 labels=frozenset({'Category'}) properties={'category': 'Smart Speaker & Hub Accessories'}>>,\n",
       " <Record n=<Node id=134527 labels=frozenset({'Category'}) properties={'category': 'Carriers & Crates'}>>,\n",
       " <Record n=<Node id=134528 labels=frozenset({'Category'}) properties={'category': 'Chargers Adapters'}>>,\n",
       " <Record n=<Node id=134529 labels=frozenset({'Category'}) properties={'category': 'Platforms'}>>,\n",
       " <Record n=<Node id=134530 labels=frozenset({'Category'}) properties={'category': 'Smart Home'}>>,\n",
       " <Record n=<Node id=134531 labels=frozenset({'Category'}) properties={'category': 'Pet Supplies: International Shipping Available'}>>,\n",
       " <Record n=<Node id=134532 labels=frozenset({'Category'}) properties={'category': 'Rice Dishes'}>>,\n",
       " <Record n=<Node id=134533 labels=frozenset({'Category'}) properties={'category': 'Racks & Holders'}>>,\n",
       " <Record n=<Node id=134534 labels=frozenset({'Category'}) properties={'category': 'Portable Audio & Headphones'}>>,\n",
       " <Record n=<Node id=134535 labels=frozenset({'Category'}) properties={'category': 'Kindle Paperwhite Accessories'}>>,\n",
       " <Record n=<Node id=134536 labels=frozenset({'Category'}) properties={'category': 'Smart Home & Connected Living'}>>,\n",
       " <Record n=<Node id=134537 labels=frozenset({'Category'}) properties={'category': 'Back To College'}>>,\n",
       " <Record n=<Node id=134538 labels=frozenset({'Category'}) properties={'category': ' Movies'}>>,\n",
       " <Record n=<Node id=134539 labels=frozenset({'Category'}) properties={'category': ' Garage & Office'}>>,\n",
       " <Record n=<Node id=134540 labels=frozenset({'Category'}) properties={'category': 'Furniture'}>>,\n",
       " <Record n=<Node id=134541 labels=frozenset({'Category'}) properties={'category': 'Oven Mitts & Potholders'}>>,\n",
       " <Record n=<Node id=134542 labels=frozenset({'Category'}) properties={'category': 'Kindle E-Reader Accessories'}>>,\n",
       " <Record n=<Node id=134543 labels=frozenset({'Category'}) properties={'category': 'Computers Features'}>>,\n",
       " <Record n=<Node id=134544 labels=frozenset({'Category'}) properties={'category': 'Audio Docks & Mini Speakers'}>>,\n",
       " <Record n=<Node id=134545 labels=frozenset({'Category'}) properties={'category': 'Office Solutions'}>>,\n",
       " <Record n=<Node id=134546 labels=frozenset({'Category'}) properties={'category': ' Dining & Bar'}>>,\n",
       " <Record n=<Node id=134547 labels=frozenset({'Category'}) properties={'category': 'Cables & Interconnects'}>>,\n",
       " <Record n=<Node id=134548 labels=frozenset({'Category'}) properties={'category': 'Coffee Pod Holders'}>>,\n",
       " <Record n=<Node id=134549 labels=frozenset({'Category'}) properties={'category': 'Bluetooth Speakers'}>>,\n",
       " <Record n=<Node id=134550 labels=frozenset({'Category'}) properties={'category': ' Music'}>>,\n",
       " <Record n=<Node id=134551 labels=frozenset({'Category'}) properties={'category': 'Genuine Tablet Accessories'}>>,\n",
       " <Record n=<Node id=134552 labels=frozenset({'Category'}) properties={'category': 'Voice-Enabled Smart Assistants'}>>,\n",
       " <Record n=<Node id=134553 labels=frozenset({'Category'}) properties={'category': 'Kindle E-readers'}>>,\n",
       " <Record n=<Node id=134554 labels=frozenset({'Category'}) properties={'category': 'Voice Assistants'}>>,\n",
       " <Record n=<Node id=134555 labels=frozenset({'Category'}) properties={'category': 'File Jackets & File Pockets'}>>,\n",
       " <Record n=<Node id=134556 labels=frozenset({'Category'}) properties={'category': 'Media Storage & Organization'}>>,\n",
       " <Record n=<Node id=134557 labels=frozenset({'Category'}) properties={'category': 'Home Office Furniture'}>>,\n",
       " <Record n=<Node id=134558 labels=frozenset({'Category'}) properties={'category': 'Cookware Accessories'}>>,\n",
       " <Record n=<Node id=134559 labels=frozenset({'Category'}) properties={'category': 'Windows Tablets'}>>,\n",
       " <Record n=<Node id=134560 labels=frozenset({'Category'}) properties={'category': 'E-Readers & Accessories'}>>,\n",
       " <Record n=<Node id=134561 labels=frozenset({'Category'}) properties={'category': 'DVD Cases'}>>,\n",
       " <Record n=<Node id=134562 labels=frozenset({'Category'}) properties={'category': 'Computer Components'}>>,\n",
       " <Record n=<Node id=134563 labels=frozenset({'Category'}) properties={'category': 'Cell Phones'}>>,\n",
       " <Record n=<Node id=134564 labels=frozenset({'Category'}) properties={'category': 'Other Computers & Networking'}>>,\n",
       " <Record n=<Node id=134565 labels=frozenset({'Category'}) properties={'category': 'Cables & Chargers'}>>,\n",
       " <Record n=<Node id=134566 labels=frozenset({'Category'}) properties={'category': 'Electronics Deals'}>>,\n",
       " <Record n=<Node id=134567 labels=frozenset({'Category'}) properties={'category': 'Amazon Devices'}>>,\n",
       " <Record n=<Node id=134568 labels=frozenset({'Category'}) properties={'category': 'Stereos'}>>,\n",
       " <Record n=<Node id=134569 labels=frozenset({'Category'}) properties={'category': 'Top Selection from AmazonPets'}>>,\n",
       " <Record n=<Node id=134570 labels=frozenset({'Category'}) properties={'category': 'AAA'}>>,\n",
       " <Record n=<Node id=134571 labels=frozenset({'Category'}) properties={'category': 'Power Adapters'}>>,\n",
       " <Record n=<Node id=134572 labels=frozenset({'Category'}) properties={'category': 'Health Personal Care'}>>,\n",
       " <Record n=<Node id=134573 labels=frozenset({'Category'}) properties={'category': '14701001'}>>,\n",
       " <Record n=<Node id=134574 labels=frozenset({'Category'}) properties={'category': ' Video & Audio Accs'}>>,\n",
       " <Record n=<Node id=134575 labels=frozenset({'Category'}) properties={'category': 'Cookware'}>>,\n",
       " <Record n=<Node id=134576 labels=frozenset({'Category'}) properties={'category': 'MP3 Accessories'}>>,\n",
       " <Record n=<Node id=134577 labels=frozenset({'Category'}) properties={'category': 'Power Adapters & Cables'}>>,\n",
       " <Record n=<Node id=134578 labels=frozenset({'Category'}) properties={'category': 'Clearance'}>>,\n",
       " <Record n=<Node id=134579 labels=frozenset({'Category'}) properties={'category': 'Hard Drive Bags & Cases'}>>,\n",
       " <Record n=<Node id=134580 labels=frozenset({'Category'}) properties={'category': 'Tvs & Home Theater'}>>,\n",
       " <Record n=<Node id=134581 labels=frozenset({'Category'}) properties={'category': 'TVs Entertainment xbqxrzdteyyb'}>>,\n",
       " <Record n=<Node id=134582 labels=frozenset({'Category'}) properties={'category': 'TVs & Electronics'}>>,\n",
       " <Record n=<Node id=134583 labels=frozenset({'Category'}) properties={'category': 'Laptop Accessories'}>>,\n",
       " <Record n=<Node id=134584 labels=frozenset({'Category'}) properties={'category': 'TVs & Home Theater'}>>,\n",
       " <Record n=<Node id=134585 labels=frozenset({'Category'}) properties={'category': 'Frys'}>>,\n",
       " <Record n=<Node id=134586 labels=frozenset({'Category'}) properties={'category': 'Hard Drives & Storage'}>>]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query('match (n) return n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "PyCharm (DS4300-Final-Project-main)",
   "language": "python",
   "name": "pycharm-381a9001"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
